app/controllers/admin/bookings_controller.rb

SELECT * FROM "bookings"
---
  def index
    @bookings = Booking.all

SELECT * FROM "bookings" WHERE ("bookings"."id" = 9)
---
  def show
    @booking = Booking.find(params[:id])

SELECT * FROM "bookings" WHERE ("bookings"."id" = 9)
---
  def edit
    @booking = Booking.find(params[:id])