app/controllers/admin/item_types_controller.rb

  def index
    @item_types = ItemType.all
---
SELECT * FROM "item_types"

  def show
    @item_type = ItemType.find(params[:id])
---
SELECT * FROM "item_types" WHERE ("item_types"."id" = 0)

  def edit
    @item_type = ItemType.find(params[:id])
---
SELECT * FROM "item_types" WHERE ("item_types"."id" = 1)

  def create
    @item_type = ItemType.new(params[:item_type])

    respond_to do |format|
      if @item_type.save
---
INSERT INTO "item_types" ("name", "created_at", "updated_at", "total") VALUES('Bunk', '2009-08-07 16:54:44', '2009-08-07 16:54:44', 10)

  def update
    @item_type = ItemType.find(params[:id])

    respond_to do |format|
      if @item_type.update_attributes(params[:item_type])
---
SELECT * FROM "item_types" WHERE ("item_types"."id" = 1)
UPDATE "item_types" SET "total" = 1, "updated_at" = '2009-08-08 22:29:42', "name" = '4-Bunk Room' WHERE "id" = 2

  def destroy
    @item_type = ItemType.find(params[:id])
    @item_type.destroy
---
SELECT * FROM "item_types" WHERE ("item_types"."id" = 10)
DELETE FROM "item_types" WHERE "id" = 10