app/controllers/admin/priced_items_controller.rb

  def index
    @priced_items = PricedItem.all
---
SELECT * FROM "priced_items"

  def show
    @priced_item = PricedItem.find(params[:id])
---
SELECT * FROM "priced_items" WHERE ("priced_items"."id" = 3)

  def edit
    @priced_item = PricedItem.find(params[:id])
---
SELECT * FROM "priced_items" WHERE ("priced_items"."id" = 2)

  def create
    @priced_item = PricedItem.new(params[:priced_item])

    respond_to do |format|
      if @priced_item.save
---
INSERT INTO "priced_items" ("name", "price", "created_at", "updated_at", "item_type_id") VALUES('Adult Bunk', 12.0, '2009-08-07 22:13:23', '2009-08-07 22:13:23', 1)

  def update
    @priced_item = PricedItem.find(params[:id])

    respond_to do |format|
      if @priced_item.update_attributes(params[:priced_item])
---
SELECT * FROM "priced_items" WHERE ("priced_items"."id" = 1)
UPDATE "priced_items" SET "updated_at" = '2009-08-08 09:24:52', "name" = 'Bunk - Adult' WHERE "id" = 1

  def destroy
    @priced_item = PricedItem.find(params[:id])
    @priced_item.destroy
---
SELECT * FROM "priced_items" WHERE ("priced_items"."id" = 4)
DELETE FROM "priced_items" WHERE "id" = 4