app/controllers/booking_items_controller.rb

  def load_booking
    @booking = Booking.find(params[:booking_id])
---
SELECT * FROM "bookings" WHERE ("bookings"."id" = 9)