app/controllers/bookings_controller.rb

SELECT * FROM "bookings"
---
  def index
    @bookings = Booking.all