app/controllers/bookings_controller.rb

SELECT * FROM "bookings" WHERE ("bookings"."user_id" = '--- :current_user
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @bookings = User.find(current_user).bookings

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)
---
  def show
    @booking = Booking.find(params[:id])

SELECT * FROM "bookings" WHERE ("bookings"."id" = 3)
---
  def edit
    @booking = Booking.find(params[:id])

INSERT INTO "bookings" ("departure", "created_at", "updated_at", "arrival", "user_id") VALUES('2009-11-14', '2009-08-10 11:55:02', '2009-08-10 11:55:02', '2009-11-10', NULL)
---
  def create
    @booking = Booking.new(params[:booking])
    @booking.user = current_user

    # FIXME: booking items get lost when validation errors are present on a new booking - doesn't seem to happen with update

    respond_to do |format|
      if @booking.save

SELECT * FROM "bookings" WHERE ("bookings"."id" = 11)
UPDATE "bookings" SET "updated_at" = '2009-08-09 14:51:48', "departure" = '2009-08-12' WHERE "id" = 9
---
  def update
    @booking = Booking.find(params[:id])
    params[:booking][:existing_booking_item_attributes] ||= {}

    respond_to do |format|
      if @booking.update_attributes(params[:booking])

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)
DELETE FROM "bookings" WHERE "id" = 1
---
  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy